const numbers = [5, 8, -1, "-6", 11, "ololo", "-2"];
let sum = 0;
for (let i = 0; i < numbers.length; i++) {
  sum += numbers[i];
}

alert("Sum is " + sum);

// оголоcити numbers
// присвоїти numbers масив з 7 елементів 5, 8, -1, '-6', 11, 'ololo', '-2': numbers = [5, 8, -1, '-6', 11, 'ololo', '-2']
// оголосити sum
// присвоїти sum 0: sum = 0
// оголосити i
// присвоїти i 0: i = 0
// перевірити, чи i менше довжини масиву: 0 < 7 - так
// присвоїти sum попереднє значення до якого додано 0-й елемент масиву: sum = 0 + 5 = 5
// збільшити i на одиницю: i = 1
// перевірити, чи i менше довжини масиву: 1 < 7 - так
// присвоїти sum попереднє значення до якого додано 1-й елемент масиву: sum = 5 + 8 = 13
// збільшити i на одиницю: i = 2
// перевірити, чи i менше довжини масиву: 2 < 7 - так
// присвоїти sum попереднє значення до якого додано 2-й елемент масиву: sum = 13 + -1 = 12
// збільшити i на одиницю: i = 3
// перевірити, чи i менше довжини масиву: 3 < 7 - так
// присвоїти sum попереднє значення до якого додано 3-й елемент масиву: sum = 12 + '-6' = '12-6'
// ТУТ ПРОГРАМА ПЕРЕСТАЄ КОРЕКТНО РАХУВАТИ СУМУ (i === 3)
// перевірити, чи i менше довжини масиву: 4 < 7 - так
// присвоїти sum попереднє значення до якого додано 4-й елемент масиву: sum = '12-6' + 11 = '12-611'
// збільшити i на одиницю: i = 5
// перевірити, чи i менше довжини масиву: 5 < 7 - так
// присвоїти sum попереднє значення до якого додано 5-й елемент масиву: sum = '12-611' + 'ololo' = '12-611ololo'
// збільшити i на одиницю: i = 6
// перевірити, чи i менше довжини масиву: 6 < 7 - так
// присвоїти sum попереднє значення до якого додано 6-й елемент масиву: sum = '12-611ololo' + '-2' = '12-611ololo-2'
// збільшити i на одиницю: i = 7
// перевірити, чи i менше довжини масиву: 7 < 7 - ні
// вивести повідомлення 'Sum is 12-611ololo-2'

// щоб сума правильно рахувалась для цього масиву, можна зробити так:

// const numbers = [5, 8, -1, "-6", 11, "ololo", "-2"];
// let sum = 0;
// for (let i = 0; i < numbers.length; i++) {
//   if (!isNaN(numbers[i])) {
//     // Тут можна ще умов додати, але юзер сам нічого ж не вводить, маємо конкретний масив, а для нього цього достатньо:)
//     sum += +numbers[i];
//   }
// }

// alert("Sum is " + sum);

// або так

// const numbers = [5, 8, -1, "-6", 11, "ololo", "-2"];
// let sum = 0;
// for (let i = 0; i < numbers.length; i++) {
//   if (isNaN(numbers[i])) {
//     continue;
//   }
//   sum += +numbers[i];
// }

// alert("Sum is " + sum);
